# Filter the "high-value" customers

In [1]:
import pandas as pd

Let's make sure we're confident of the results by using the results of the merging to wrangle this into the high-value customers!

In [2]:
# Import the cleaned dataset from CSV file into a DataFrame
df = pd.read_csv(
    "../tests/test_data/expected_merged_clean_results.csv"
)

---

## Calculate Customer Total Spend

We need to calculate the total spent by each customer.

1) Group by the `customer_id`
2) Access the `amount` column
3) `sum` the `amount` column
4) Reset the indexes (so that the `customer_id` remains the indexed column)
5) Rename the `amount` column to `total_spent`

In [3]:
# Calculate the total amount spent by each customer
total_spent = df.groupby("customer_id")["amount"].sum().reset_index()

# Rename the column to reflect the total spent
total_spent.rename(columns={"amount": "total_spent"}, inplace=True)

# Display the result
print(total_spent)

      customer_id  total_spent
0               1       664.27
1               2        41.98
2               3       326.52
3               4       373.57
4               5       540.85
...           ...          ...
3857         5192      1477.32
3858         5193       736.36
3859         5195       671.70
3860         5197      1173.74
3861         5200       332.39

[3862 rows x 2 columns]

---

## Filter for a Total Spend of >500

Let's reduce this dataset so that only the customers who have spent more than 500 are kept.

1) Run a query the `total_spend` column for those with a value greater than 500 and reassign the DataFrame

In [4]:
# Query the DataFrame for customers who have spent more than 500
total_spent = total_spent.query("total_spent > 500")

total_spent

      customer_id  total_spent
0               1       664.27
4               5       540.85
5               6      1266.13
6               7       547.32
10             11       844.08
...           ...          ...
3851         5185      1156.50
3857         5192      1477.32
3858         5193       736.36
3859         5195       671.70
3860         5197      1173.74

[1818 rows x 2 columns]

In [5]:
# Export this DataFrame to a CSV file for testing purposes
total_spent.to_csv(
    "../tests/test_data/expected_filtered_total_spent.csv", index=False
)

---

## Calculate Average Transaction Value for each Customer

Create a second DataFrame to calculate the average transaction value:

1) Group by the `customer_id`
2) Access the `amount` column
3) Get the `mean` the `amount` column
4) Reset the indexes (so that the `customer_id` remains the indexed column)
5) Rename the `amount` column to `avg_transaction_value`

In [6]:
# Calculate the average transaction value for each customer
avg_transaction_value = (
    df.groupby("customer_id")["amount"].mean().reset_index()
)

# Rename the column to reflect the average transaction value
avg_transaction_value.rename(
    columns={"amount": "avg_transaction_value"}, inplace=True
)

# Display the result
avg_transaction_value

      customer_id  avg_transaction_value
0               1             221.423333
1               2              41.980000
2               3             163.260000
3               4             186.785000
4               5             270.425000
...           ...                    ...
3857         5192             369.330000
3858         5193             245.453333
3859         5195             167.925000
3860         5197             391.246667
3861         5200             332.390000

[3862 rows x 2 columns]

In [7]:
# Export the average transaction value DataFrame to a CSV file for testing purposes
avg_transaction_value.to_csv(
    "../tests/test_data/expected_avg_transaction_value.csv", index=False
)

---

## Merge the Filtered DataFrame with the average spend DataFrame

This merge will give us only the customers who have spent over 500, displaying their average spend per transaction.

In [8]:
# Merge with your filtered total_spent dataframe

filtered_df = pd.merge(total_spent, avg_transaction_value, on="customer_id")

filtered_df.head()
filtered_df.shape

(1818, 3)

And now we're happy, lets export the result of the merge into a CSV file so we can test against it in the pipeline

In [9]:
filtered_df.to_csv(
    "../tests/test_data/expected_filtered_clean_results.csv", index=False
)

---

### Onwards!

Now complete the integration of this code into the transform functionality of the pipeline:

- i.e. ***Epic 2 - Story 5 - Tasks 4-7***